<script lang='ts'>
import { defineComponent, ref } from "vue";
export default defineComponent({
  setup() {
    return {
      tableData: ref([
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
        { 1: "1", 2: "2", 3: "2", 4: "2", 5: "2" },
      ]),
    };
  },
});
</script>

<template>
  <div>
    <n-alert type="info">
      本站仅显示最近20条下载记录，下载数据链接仅在站内保存48小时。
    </n-alert>
    <el-table :data="tableData" stripe style="width: 100%;" max-height="550">
      <el-table-column prop="1" label="序号" width="100" />
      <el-table-column prop="7" label="资源名" width="250" />
      <el-table-column prop="2" label="下载时间" width="160" />
      <el-table-column prop="3" label="下载路径" width="150" />
      <el-table-column prop="4" label="下载状态" width="120" />
      <el-table-column prop="5" label="大小" width="120" />
      <el-table-column prop="6"  fixed="right" width="100" label="链接">
        <template #default>
          <n-button text type="info">下载</n-button>
        </template>
      </el-table-column>
    </el-table>
  </div>
</template>

<style scoped lang='less'>
</style>
